tutorials/multiRegion/film/hotBoxes/0/fluid/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-5;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    sides
    {
        type            kqRWallFunction;
        value           uniform 1e-5;
    }

    film
    {
        type            kqRWallFunction;
        value           uniform 1e-5;
    }
}

// ************************************************************************* //
